{
  "resolutions": [
    {
      "resolutionNo": "2025-12-188",
      "title": "A Resolution Urging the City Mayor Florida P. Robes, Thru Business Permits and Licensing Office (BPLO) of the City of San Jose del Monte, Bulacan Not to Renew the Business Permit of Primewater Infrastructure Corporation Due to Numerous Violations and Continued Non-Compliance with Its Undertakings Under the Joint Venture Agreement with the San Jose del Monte Water District, Resulting in Poor Water Service, Inadequate Supply, Low Water Quality and Lack of Substantial Investment to the Prejudice of San Joseños",
      "sessionDate": "2025-12-10"
    },
    {
      "resolutionNo": "2025-12-179",
      "title": "A Resolution Extending Highest Commendation to the City of San Jose del Monte Men's and Women's Volleyball Team 'Rising Star' for Winning the Makata Cup / ACVL and Commending the Women's Team for Achieving Two Consecutive Championship Titles",
      "sessionDate": "2025-12-03"
    },
    {
      "resolutionNo": "2025-12-178",
      "title": "A Resolution Congratulating and Commending the CSJDM Men's Volleyball Team for Their Stellar Performance in Bagging the Championship Title in the Recently Held All-Star Champions Volleyball League (ACVL 2025) Held Last November 26, 2025 at Bulacan Capitol Gymnasium, Malolos City",
      "sessionDate": "2025-11-26"
    },
    {
      "resolutionNo": "2025-12-177",
      "title": "A Resolution Congratulating and Commending the CSJDM Women's Volleyball Team for Their Stellar Performance in Bagging the Championship Title in the Recently Held All-Star Champions Volleyball League (ACVL 2025) Last November 25, 2025 at the Bulacan Capitol Gymnasium, Malolos City",
      "sessionDate": "2025-11-25"
    },
    {
      "resolutionNo": "2025-11-156",
      "title": "A Resolution Congratulating the City Government of San Jose del Monte, Bulacan and City Environment and Natural Resources Office for Achieving 3rd Runner Up Eco-Friendly Award in Manila Times Philippine Model Cities and Municipalities Awards 2025 Held on November 14, 2025 at the Manila Hotel, City of Manila",
      "sessionDate": "2025-11-19"
    },
    {
      "resolutionNo": "2025-10-105",
      "title": "A Resolution Urging His Excellency President Ferdinand 'Bongbong' Marcos Jr. to Intervene and Assist the City Government of San Jose del Monte, Bulacan and the San Jose del Monte City Water District in the Termination of the Joint Venture Agreement with Prime Water Infrastructure Corporation Due to the Latter's Failure to Comply with Its Undertakings Under the Agreement",
      "sessionDate": "2025-10-15"
    },
    {
      "resolutionNo": "2025-09-097",
      "title": "A Resolution Earnestly Requesting the San Jose Water to Transmit to the Sangguniang Panlungsod Copies of (1) the Letter of Termination of the Joint Venture Agreement with Prime Water Infrastructure Corporation Submitted in July 2025, and (2) the Original Joint Venture Agreement Executed in 2018",
      "sessionDate": "2025-10-01"
    },
    {
      "resolutionNo": "2025-09-077",
      "title": "A Resolution Commending and Congratulating the City of San Jose del Monte-City Environment and Natural Resources Office for Once Again Being Recognized by the Philippine Civil Service Commission Region III with the Prestigious Gawad Lingkod Bayani 2025 for Its Exemplary Contribution to the Community and the Environment Held in City of San Fernando, Pampanga on September 10, 2025",
      "sessionDate": "2025-09-17"
    },
    {
      "resolutionNo": "2025-09-073",
      "title": "A Resolution Authorizing the Local Chief Executive, to Represent the City Government of San Jose del Monte, Bulacan, and Enter Into a Memorandum of Agreement (MOA) with the Department of Labor and Employment (DOLE) and the Golden Arches Development Corporation, for the Hiring and Employment of Senior Citizens to Various McDonald's Stores",
      "sessionDate": "2025-09-17"
    },
    {
      "resolutionNo": "2025-09-071",
      "title": "A Resolution Commending the Invaluable Efforts and Contributions of City Mayor Hon. Florida P. Robes, Congressman Arturo B. Robes in Cooperation with the City Government Officials and Employees, Barangay Officials and Civic Society Organizations in the Success of the Recently Concluded Tanglawan Festival 2025",
      "sessionDate": "2025-09-11"
    },
    {
      "resolutionNo": "2025-09-067",
      "title": "A Resolution Congratulating Barangay Clusters 4, 5, 6 and 10 for Being Winners of Arya-Aryahan 2025 - Parada ng Sayaw at Galaw ng Kultura, Indak ng Pagkakaisa",
      "sessionDate": "2025-09-11"
    },
    {
      "resolutionNo": "2025-1771-06",
      "title": "A Resolution Expressing the Sangguniang Panlungsod of San Jose del Monte's Warmest Congratulations to the CSJDM Athletes Who Emerged as Winners in the Recently Concluded Palarong Pambansa Held in Laoag City, Ilocos Norte Last May 3, 2025 - June 2, 2025",
      "sessionDate": "2025-06-02"
    },
    {
      "resolutionNo": "2025-1750-05",
      "title": "A Resolution of Recognition and Commendation to Commissioned 2nd Lieutenant Kenneth Bernard M. Salvatierra, Ensign Lionel D. Padulaga, Commissioned 2nd Lieutenant Peter John M. Panopio, Commissioned 2nd Lieutenant Ferdenan Rees Macalay and Commissioned 2nd Lieutenant Remedios Racma Briones Lopez as San Joseño Graduates of the Philippine Military Academy (PMA) Class 2025 Bringing Pride, Honor and Glory to This City",
      "sessionDate": "2025-05-03"
    },
    {
      "resolutionNo": "2025-1742-04",
      "title": "A Resolution Supporting the Intention of the San Jose del Monte City Water District (San Jose Water) to Pre-Terminate Its Joint Venture Agreement with Its Private Partner Primewater Infrastructure Corporation (PWIC), Thus, Requesting the Office of the Government Corporate Counsel to Work for the Expeditious Termination of the Agreement",
      "sessionDate": "2025-04-01"
    },
    {
      "resolutionNo": "2025-1730-04",
      "title": "A Resolution Congratulating and Commending the CSJDM Rising Stars Senior Division Basketball Team for Their Stellar Performance in Bagging the Championship Title in the Recently Held 2025 Makata Cup in Balagtas, Bulacan",
      "sessionDate": "2025-04-01"
    },
    {
      "resolutionNo": "2025-1665-03",
      "title": "A Resolution Congratulating and Commending Mr. Roberto P. Ramirez Jr., City Tourism Officer, for Being Awarded as the Most Outstanding Tourism Officer/Manager at the Tourism Recognition for Enterprises and Stakeholders (TRES) Award 2024 by the Department of Tourism Region III Held on February 24, 2025 at Hilltop, Filinvest Mimosa Leisure City, Clark Freeport Zone, Clark, Pampanga",
      "sessionDate": "2025-03-05"
    },
    {
      "resolutionNo": "2025-1537-01",
      "title": "Kapasiyahan na Pinagtitibay ang Pagpapalawig sa Pagbabayad ng Buwis sa Pagnegosy ng Walang Kaukulang Multa Hanggang Ika-28 ng Pebrero 2025 Kaalinsabay ang Pagsusuog sa Itinatadhan ng Article 5 Section 61 ng 'Revised Revenue Code of 2012' na May Petsang Hulyo 04, 2012 ng Lungsod na Ito",
      "sessionDate": "2025-01-15"
    }
  ]
}
